src/cf/Documents/ТранспортнаяНакладнаяЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТранспортнаяНакладнаяЕГАИС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЕГАИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварВПутиПринадлежитГрузополучателю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТранспортаЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктРазгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перенаправление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеТранспортнаяНакладнаяЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварноТранспортнаяНакладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТТНВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ТТНИсходящаяЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеНакладные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ТТНВходящаяЕГАИС</v8:Type>
								<v8:Type>cfg:DocumentRef.ТранспортнаяНакладнаяЕГАИС</v8:Type>
								<v8:Type>cfg:DocumentRef.ТТНИсходящаяЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыДокументовЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументовЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтатусыОбработкиДокументовЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияПолученЕГАИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияПроведенЕГАИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОРегистрацииДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыОбработкиТранспортныхНакладныхЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиТранспортныхНакладныхЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданВУТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатываетсяЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведенЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведенияЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияПереданВУТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияОбрабатываетсяЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияОшибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ТранспортнаяНакладнаяЕГАИС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ТТНИсходящаяЕГАИС") Тогда
		
		ЗаполнитьНаОснованииТТНИсходящейЕГАИС(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ТТНВходящаяЕГАИС") Тогда
		
		ЗаполнитьНаОснованииТТНВходящейЕГАИС(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	Иначе
		
		ИнтеграцияЕГАИСПереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ИнтеграцияЕГАИСПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = ИнтеграцияЕГАИС.НовыйИдентификаторДокумента();
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияЕГАИС.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияЕГАИС.ЗаписатьСтатусДокументаЕГАИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование  = Неопределено;
	Идентификатор      = "";
	ИдентификаторЕГАИС = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииТТНИсходящейЕГАИС(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ДокументТТНИсходящаяЕГАИС.Ссылка                     КАК Ссылка,
		|	ДокументТТНИсходящаяЕГАИС.Грузоотправитель           КАК Грузоотправитель,
		|	ДокументТТНИсходящаяЕГАИС.ТипДоставки                КАК ТипДоставки,
		|	ДокументТТНИсходящаяЕГАИС.Перевозчик                 КАК Перевозчик,
		|	ДокументТТНИсходящаяЕГАИС.ТипТранспорта              КАК ТипТранспорта,
		|	ДокументТТНИсходящаяЕГАИС.ТоварВПутиПринадлежитГрузополучателю КАК ТоварВПутиПринадлежитГрузополучателю,
		|	ДокументТТНИсходящаяЕГАИС.НомерТранспортногоСредства КАК НомерТранспортногоСредства,
		|	ДокументТТНИсходящаяЕГАИС.Прицеп                     КАК Прицеп,
		|	ДокументТТНИсходящаяЕГАИС.Заказчик                   КАК Заказчик,
		|	ДокументТТНИсходящаяЕГАИС.Водитель                   КАК Водитель,
		|	ДокументТТНИсходящаяЕГАИС.ПунктПогрузки              КАК ПунктПогрузки,
		|	ДокументТТНИсходящаяЕГАИС.ПунктРазгрузки             КАК ПунктРазгрузки,
		|	ДокументТТНИсходящаяЕГАИС.Перенаправление            КАК Перенаправление,
		|	ДокументТТНИсходящаяЕГАИС.Экспедитор                 КАК Экспедитор,
		|	
		|	СтатусыДокументовЕГАИС.Статус              КАК СтатусЕГАИС,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие1 КАК ДальнейшееДействиеЕГАИС1,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие2 КАК ДальнейшееДействиеЕГАИС2,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие3 КАК ДальнейшееДействиеЕГАИС3
		|ИЗ
		|	Документ.ТТНИсходящаяЕГАИС КАК ДокументТТНИсходящаяЕГАИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
		|		ПО (СтатусыДокументовЕГАИС.Документ = ДокументТТНИсходящаяЕГАИС.Ссылка)
		|ГДЕ
		|	ДокументТТНИсходящаяЕГАИС.Ссылка = &Ссылка",
		"ТТНИсходящаяЕГАИС");
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	СУММА(Товары.Количество) КАК Количество
		|ИЗ
		|	Документ.ТТНИсходящаяЕГАИС.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка",
		"ИтогПоКоличеству");
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ДокументТранспортнаяНакладнаяЕГАИС.Ссылка                               КАК Ссылка,
		|	ДокументТранспортнаяНакладнаяЕГАИС.НомерТН                              КАК НомерТН,
		|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН                               КАК ДатаТН,
		|	ДокументТранспортнаяНакладнаяЕГАИС.ТоварВПутиПринадлежитГрузополучателю КАК ТоварВПутиПринадлежитГрузополучателю,
		|	ДокументТранспортнаяНакладнаяЕГАИС.ПунктРазгрузки                       КАК ПунктРазгрузки,
		|	ДокументТранспортнаяНакладнаяЕГАИС.Количество                           КАК Количество,
		|	
		|	СтатусыДокументовЕГАИС.Статус              КАК СтатусЕГАИС,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие1 КАК ДальнейшееДействиеЕГАИС1,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие2 КАК ДальнейшееДействиеЕГАИС2,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие3 КАК ДальнейшееДействиеЕГАИС3
		|ИЗ
		|	Документ.ТранспортнаяНакладнаяЕГАИС КАК ДокументТранспортнаяНакладнаяЕГАИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
		|		ПО (СтатусыДокументовЕГАИС.Документ = ДокументТранспортнаяНакладнаяЕГАИС.Ссылка)
		|ГДЕ
		|	ДокументТранспортнаяНакладнаяЕГАИС.ТоварноТранспортнаяНакладная = &Ссылка
		|	И НЕ СтатусыДокументовЕГАИС.Статус В (&КонечныеСтатусы)
		|	И НЕ ДокументТранспортнаяНакладнаяЕГАИС.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН ВОЗР,
		|	ДокументТранспортнаяНакладнаяЕГАИС.Дата ВОЗР
		|",
		"ТранспортныеНакладные");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("КонечныеСтатусы", Документы.ТранспортнаяНакладнаяЕГАИС.КонечныеСтатусы());
	
	РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
	
	//@skip-warning
	ВыборкаТТНИсходящаяЕГАИС = РезультатыЗапроса["ТТНИсходящаяЕГАИС"].Выбрать();
	//@skip-warning
	ВыборкаИтогПоКоличеству = РезультатыЗапроса["ИтогПоКоличеству"].Выбрать();
	//@skip-warning
	ТаблицаТранспортныеНакладные = РезультатыЗапроса["ТранспортныеНакладные"].Выгрузить();
	
	ВыборкаТТНИсходящаяЕГАИС.Следующий();
	ВыборкаИтогПоКоличеству.Следующий();
	
	Если ВыборкаТТНИсходящаяЕГАИС.ТоварВПутиПринадлежитГрузополучателю Тогда
		ВызватьИсключение НСтр("ru = 'Не требуется, транспортную накладную оформляет грузополучатель'");
	Иначе
		
		ТоварВПутиПринадлежитГрузополучателю = Ложь;
		Для Каждого Выборка Из ТаблицаТранспортныеНакладные Цикл
			Если Выборка.СтатусЕГАИС = Перечисления.СтатусыОбработкиТранспортныхНакладныхЕГАИС.ПроведенЕГАИС
				И Выборка.ТоварВПутиПринадлежитГрузополучателю Тогда
				ТоварВПутиПринадлежитГрузополучателю = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ТоварВПутиПринадлежитГрузополучателю Тогда
			ВызватьИсключение НСтр("ru = 'Не требуется, транспортную накладную оформляет грузополучатель'");
		КонецЕсли;
		
		ОрганизацияЕГАИС             = ВыборкаТТНИсходящаяЕГАИС.Грузоотправитель;
		ТоварноТранспортнаяНакладная = ВыборкаТТНИсходящаяЕГАИС.Ссылка;
		Заказчик                     = ВыборкаТТНИсходящаяЕГАИС.Заказчик;
		
		Если ТаблицаТранспортныеНакладные.Количество() = 0 Тогда
			
			ПунктПогрузки              = ВыборкаТТНИсходящаяЕГАИС.ПунктРазгрузки;
			ПунктРазгрузки             = Неопределено;
			
			Перевозчик                 = Неопределено;
			Перенаправление            = Неопределено;
			ТипТранспорта              = Неопределено;
			НомерТранспортногоСредства = Неопределено;
			Прицеп                     = Неопределено;
			Водитель                   = Неопределено;
			Экспедитор                 = Неопределено;
			Количество                 = ВыборкаИтогПоКоличеству.Количество;
			
		Иначе
			
			ПоследняяТранспортнаяНакладная = ТаблицаТранспортныеНакладные[ТаблицаТранспортныеНакладные.Количество() - 1];
			
			ПунктПогрузки              = ПоследняяТранспортнаяНакладная.ПунктРазгрузки;
			ПунктРазгрузки             = Неопределено;
			
			Перевозчик                 = Неопределено;
			Перенаправление            = Неопределено;
			ТипТранспорта              = Неопределено;
			НомерТранспортногоСредства = Неопределено;
			Прицеп                     = Неопределено;
			Водитель                   = Неопределено;
			Экспедитор                 = Неопределено;
			Количество                 = ПоследняяТранспортнаяНакладная.Количество;
			
			НоваяСтрока = ТранспортныеНакладные.Добавить();
			НоваяСтрока.ДокументОснование = ПоследняяТранспортнаяНакладная.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииТТНВходящейЕГАИС(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ДокументТТНВходящаяЕГАИС.Ссылка                               КАК Ссылка,
		|	ДокументТТНВходящаяЕГАИС.Грузополучатель                      КАК Грузополучатель,
		|	ДокументТТНВходящаяЕГАИС.ТипДоставки                          КАК ТипДоставки,
		|	ДокументТТНВходящаяЕГАИС.Перевозчик                           КАК Перевозчик,
		|	ДокументТТНВходящаяЕГАИС.ТипТранспорта                        КАК ТипТранспорта,
		|	ДокументТТНВходящаяЕГАИС.ТоварВПутиПринадлежитГрузополучателю КАК ТоварВПутиПринадлежитГрузополучателю,
		|	ДокументТТНВходящаяЕГАИС.НомерТранспортногоСредства           КАК НомерТранспортногоСредства,
		|	ДокументТТНВходящаяЕГАИС.Прицеп                               КАК Прицеп,
		|	ДокументТТНВходящаяЕГАИС.Заказчик                             КАК Заказчик,
		|	ДокументТТНВходящаяЕГАИС.Водитель                             КАК Водитель,
		|	ДокументТТНВходящаяЕГАИС.ПунктПогрузки                        КАК ПунктПогрузки,
		|	ДокументТТНВходящаяЕГАИС.ПунктРазгрузки                       КАК ПунктРазгрузки,
		|	ДокументТТНВходящаяЕГАИС.Перенаправление                      КАК Перенаправление,
		|	ДокументТТНВходящаяЕГАИС.Экспедитор                           КАК Экспедитор,
		|	ДокументТТНВходящаяЕГАИС.НомерТранспортнойНакладной           КАК НомерТранспортнойНакладной,
		|	ДокументТТНВходящаяЕГАИС.ДатаТранспортнойНакладной            КАК ДатаТранспортнойНакладной,
		|
		|	СтатусыДокументовЕГАИС.Статус              КАК СтатусЕГАИС,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие1 КАК ДальнейшееДействиеЕГАИС1,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие2 КАК ДальнейшееДействиеЕГАИС2,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие3 КАК ДальнейшееДействиеЕГАИС3
		|ИЗ
		|	Документ.ТТНВходящаяЕГАИС КАК ДокументТТНВходящаяЕГАИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
		|		ПО (СтатусыДокументовЕГАИС.Документ = ДокументТТНВходящаяЕГАИС.Ссылка)
		|ГДЕ
		|	ДокументТТНВходящаяЕГАИС.Ссылка = &Ссылка",
		"ТТНВходящаяЕГАИС");
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	СУММА(Товары.Количество) КАК Количество
		|ИЗ
		|	Документ.ТТНВходящаяЕГАИС.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка",
		"ИтогПоКоличеству");
	
	ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ДокументТранспортнаяНакладнаяЕГАИС.Ссылка                               КАК Ссылка,
		|	ДокументТранспортнаяНакладнаяЕГАИС.НомерТН                              КАК НомерТН,
		|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН                               КАК ДатаТН,
		|	ДокументТранспортнаяНакладнаяЕГАИС.ТоварВПутиПринадлежитГрузополучателю КАК ТоварВПутиПринадлежитГрузополучателю,
		|	ДокументТранспортнаяНакладнаяЕГАИС.Заказчик                             КАК Заказчик,
		|	ДокументТранспортнаяНакладнаяЕГАИС.ПунктРазгрузки                       КАК ПунктРазгрузки,
		|	ДокументТранспортнаяНакладнаяЕГАИС.Количество                           КАК Количество,
		|	
		|	СтатусыДокументовЕГАИС.Статус              КАК СтатусЕГАИС,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие1 КАК ДальнейшееДействиеЕГАИС1,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие2 КАК ДальнейшееДействиеЕГАИС2,
		|	СтатусыДокументовЕГАИС.ДальнейшееДействие3 КАК ДальнейшееДействиеЕГАИС3
		|ИЗ
		|	Документ.ТранспортнаяНакладнаяЕГАИС КАК ДокументТранспортнаяНакладнаяЕГАИС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
		|		ПО (СтатусыДокументовЕГАИС.Документ = ДокументТранспортнаяНакладнаяЕГАИС.Ссылка)
		|ГДЕ
		|	ДокументТранспортнаяНакладнаяЕГАИС.ТоварноТранспортнаяНакладная = &Ссылка
		|	И НЕ СтатусыДокументовЕГАИС.Статус В (&КонечныеСтатусы)
		|	И НЕ ДокументТранспортнаяНакладнаяЕГАИС.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументТранспортнаяНакладнаяЕГАИС.ДатаТН ВОЗР,
		|	ДокументТранспортнаяНакладнаяЕГАИС.Дата ВОЗР
		|",
		"ТранспортныеНакладные");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("КонечныеСтатусы", Документы.ТранспортнаяНакладнаяЕГАИС.КонечныеСтатусы());
	
	РезультатыЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
	
	//@skip-warning
	ВыборкаТТНВходящаяЕГАИС = РезультатыЗапроса["ТТНВходящаяЕГАИС"].Выбрать();
	//@skip-warning
	ВыборкаИтогПоКоличеству = РезультатыЗапроса["ИтогПоКоличеству"].Выбрать();
	//@skip-warning
	ТаблицаТранспортныеНакладные = РезультатыЗапроса["ТранспортныеНакладные"].Выгрузить();
	
	ВыборкаТТНВходящаяЕГАИС.Следующий();
	ВыборкаИтогПоКоличеству.Следующий();
	
	Если Не ВыборкаТТНВходящаяЕГАИС.ТоварВПутиПринадлежитГрузополучателю
		И Не ЗначениеЗаполнено(ВыборкаТТНВходящаяЕГАИС.НомерТранспортнойНакладной) Тогда
		ВызватьИсключение НСтр("ru = 'Не требуется, транспортную накладную оформляет грузоотправитель'");
	Иначе
		
		ОрганизацияЕГАИС                     = ВыборкаТТНВходящаяЕГАИС.Грузополучатель;
		ТоварноТранспортнаяНакладная         = ВыборкаТТНВходящаяЕГАИС.Ссылка;
		ТоварВПутиПринадлежитГрузополучателю = Истина;
		
		Если ТаблицаТранспортныеНакладные.Количество() = 0 Тогда
			
			ПунктПогрузки              = Неопределено;
			ПунктРазгрузки             = Неопределено;
			
			Перевозчик                 = Неопределено;
			Перенаправление            = Неопределено;
			ТипТранспорта              = Неопределено;
			НомерТранспортногоСредства = Неопределено;
			Прицеп                     = Неопределено;
			Водитель                   = Неопределено;
			Экспедитор                 = Неопределено;
			Количество                 = ВыборкаИтогПоКоличеству.Количество;
			
		Иначе
			
			ПоследняяТранспортнаяНакладная = ТаблицаТранспортныеНакладные[ТаблицаТранспортныеНакладные.Количество() - 1];
			
			Заказчик                   = ПоследняяТранспортнаяНакладная.Заказчик;
			ПунктПогрузки              = ПоследняяТранспортнаяНакладная.ПунктРазгрузки;
			ПунктРазгрузки             = Неопределено;
			
			Перевозчик                 = Неопределено;
			Перенаправление            = Неопределено;
			ТипТранспорта              = Неопределено;
			НомерТранспортногоСредства = Неопределено;
			Прицеп                     = Неопределено;
			Водитель                   = Неопределено;
			Экспедитор                 = Неопределено;
			Количество                 = ПоследняяТранспортнаяНакладная.Количество;
			
			НоваяСтрока = ТранспортныеНакладные.Добавить();
			НоваяСтрока.ДокументОснование = ПоследняяТранспортнаяНакладная.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
